Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.SetActiveDrawing Method
Overload List
Name | Description
SetActiveDrawing(Drawing)
 Sets the active drawing that is currently open in Tekla Structures.
SetActiveDrawing(Drawing, Boolean)
 Sets the active drawing that is currently open in Tekla Structures.
SetActiveDrawing(Drawing, Boolean, Boolean)
 Sets the active drawing that is currently open in Tekla Structures.
Top
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace